/// <reference path="./JanggiEngine.ts" />
/// <reference path="./JanggiEngine_AI.ts" />
/// <reference path="./JanggiEngine_Bill.ts" />
/// <reference path="./Play.ts" />
/// <reference path="./Palgak.ts" />
/// <reference path="./Util.ts" />
/// <reference path="./WeightedValue.ts" />
var MapManager = /** @class */ (function () {
    function MapManager(choStyle, hanStyle) {
        this.cho = choStyle;
        this.han = hanStyle;
    }
    MapManager.prototype.GetMap = function () {
        var map = [];
        if (this.han == BoardArrangementMode.Center && this.cho == BoardArrangementMode.Center) {
            //map = "안상대안상";
            map = [
                ['C0', 'M0', 'X0', 'S0', , 'S1', 'X1', 'M1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'm0', 'x0', 's0', , 's1', 'x1', 'm1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Center && this.cho == BoardArrangementMode.Left) {
            //map = "안상대왼상";
            map = [
                ['C0', 'M0', 'X0', 'S0', , 'S1', 'X1', 'M1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'm0', 'x0', 's0', , 's1', 'm1', 'x1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Center && this.cho == BoardArrangementMode.Right) {
            //map = "안상대오른상";
            map = [
                ['C0', 'M0', 'X0', 'S0', , 'S1', 'X1', 'M1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'x0', 'm0', 's0', , 's1', 'x1', 'm1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Center && this.cho == BoardArrangementMode.Both) {
            //map = "안상대양귀마";
            map = [
                ['C0', 'M0', 'X0', 'S0', , 'S1', 'X1', 'M1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'x0', 'm0', 's0', , 's1', 'm1', 'x1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Left && this.cho == BoardArrangementMode.Center) {
            //map = "왼상대안상";
            map = [
                ['C0', 'X0', 'M0', 'S0', , 'S1', 'X1', 'M1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'm0', 'x0', 's0', , 's1', 'x1', 'm1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Left && this.cho == BoardArrangementMode.Left) {
            //map = "왼상대왼상";
            map = [
                ['C0', 'X0', 'M0', 'S0', , 'S1', 'X1', 'M1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'm0', 'x0', 's0', , 's1', 'm1', 'x1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Left && this.cho == BoardArrangementMode.Right) {
            //map = "왼상대오른상";
            map = [
                ['C0', 'X0', 'M0', 'S0', '', 'S1', 'X1', 'M1', 'C1'],
                ['', '', '', '', 'J0', '', '', '', ''],
                ['', 'P0', '', '', '', '', '', 'P1', ''],
                ['Z0', '', 'Z1', '', 'Z2', '', 'Z3', '', 'Z4'],
                ['', '', '', '', '', '', '', '', ''],
                ['', '', '', '', '', '', '', '', ''],
                ['z0', '', 'z1', '', 'z2', '', 'z3', '', 'z4'],
                ['', 'p0', '', '', '', '', '', 'p1', ''],
                ['', '', '', '', 'j0', '', '', '', ''],
                ['c0', 'x0', 'm0', 's0', '', 's1', 'x1', 'm1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Left && this.cho == BoardArrangementMode.Both) {
            //map = "왼상대양귀마";
            map = [
                ['C0', 'X0', 'M0', 'S0', , 'S1', 'X1', 'M1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'x0', 'm0', 's0', , 's1', 'm1', 'x1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Right && this.cho == BoardArrangementMode.Center) {
            //map = "오른상대안상";
            map = [
                ['C0', 'M0', 'X0', 'S0', , 'S1', 'M1', 'X1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'm0', 'x0', 's0', , 's1', 'x1', 'm1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Right && this.cho == BoardArrangementMode.Left) {
            //map = "오른상대왼상";
            map = [
                ['C0', 'M0', 'X0', 'S0', , 'S1', 'M1', 'X1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'm0', 'x0', 's0', , 's1', 'm1', 'x1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Right && this.cho == BoardArrangementMode.Right) {
            //map = "오른상대오른상";
            map = [
                ['C0', 'M0', 'X0', 'S0', , 'S1', 'M1', 'X1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'x0', 'm0', 's0', , 's1', 'x1', 'm1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Right && this.cho == BoardArrangementMode.Both) {
            //map = "오른상대양귀마";
            map = [
                ['C0', 'M0', 'X0', 'S0', , 'S1', 'M1', 'X1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'x0', 'm0', 's0', , 's1', 'm1', 'x1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Both && this.cho == BoardArrangementMode.Center) {
            //map = "양귀마대안상";
            map = [
                ['C0', 'X0', 'M0', 'S0', , 'S1', 'M1', 'X1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'm0', 'x0', 's0', , 's1', 'x1', 'm1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Both && this.cho == BoardArrangementMode.Left) {
            //map = "양귀마대왼상";
            map = [
                ['C0', 'X0', 'M0', 'S0', , 'S1', 'M1', 'X1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'm0', 'x0', 's0', , 's1', 'm1', 'x1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Both && this.cho == BoardArrangementMode.Right) {
            //map = "양귀마대오른상";
            map = [
                ['C0', 'X0', 'M0', 'S0', , 'S1', 'M1', 'X1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'x0', 'm0', 's0', , 's1', 'x1', 'm1', 'c1']
            ];
        }
        else if (this.han == BoardArrangementMode.Both && this.cho == BoardArrangementMode.Both) {
            //map = "양귀마대양귀마";
            map = [
                ['C0', 'X0', 'M0', 'S0', , 'S1', 'M1', 'X1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'x0', 'm0', 's0', , 's1', 'm1', 'x1', 'c1']
            ];
        }
        else {
            map = [
                ['C0', 'M0', 'X0', 'S0', , 'S1', 'X1', 'M1', 'C1'],
                [, , , , 'J0', , , ,],
                [, 'P0', , , , , , 'P1',],
                ['Z0', , 'Z1', , 'Z2', , 'Z3', , 'Z4'],
                [, , , , , , , ,],
                [, , , , , , , ,],
                ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
                [, 'p0', , , , , , 'p1',],
                [, , , , 'j0', , , ,],
                ['c0', 'm0', 'x0', 's0', , 's1', 'x1', 'm1', 'c1']
            ];
        }
        //// Test 맵 들어오는 부분
        ///// <summary>[2] 에러 잡기: 한이 마장을 부르면 초가 외통인데, 끝나지 않음</summary>
        //map = [
        //    [, , , , , 'J0' , , , ],
        //    [, , , , 'S0', , , , ],
        //    [, , , , , , , , ],
        //    [, , , 'z1', , , , , ],
        //    [, , , , , , 'm0', , ],
        //    [, , , , , , , , ],
        //    [, , , , 'M0',  , , , ],
        //    [, , , , , , , , ],
        //    [, , , , 's0', 's1', , , ],
        //    [, , , , 'p0', 'j0', , , ]
        //]
        ///// <summary>[3] 에러 잡기: 차장 부르면 왕이 밑(위)으로 내려야 하는데, 중급은 정상처리 나머지는 왕이 잡히는 자리로 감</summary>
        //map = [
        //    [, , 'c0', 'p0', 'P0', , , ,],
        //    [, , , , , , , , ],
        //    [, , , , , 'J0', 'm0', , ],
        //    [, , , , , , , , ],
        //    [, , , , , , , , ],
        //    [, , , 'z1', , , , , ],
        //    [, , , , 'z0', , , , ],
        //    [, , , , , , , , ],
        //    [, , , , 's0', 's1', , , ],
        //    [, , , , '', 'j0', , , ]
        //];
        //// Test 맵 들어오는 부분
        ///// 연장군: http://cafe.naver.com/janggiacademy/76882
        //map = [
        //    [, , , , 'J0', , , , ],
        //    [, 'm1', , 'z0', ,'z1' , , , ],
        //    [, , 'x0', 'S0', , 'z2', , 'x1', ],
        //    [, , , , 'X0' , 'P0', 'X1' ,'c0', ],
        //    [, , , , , , , , ],
        //    [, , , , , , , , 'p0'],
        //    [, , , 'm0', ,  , 'M0', , ],
        //    ['p1', , , , 'c1',  , ,'C1' , ],
        //    [, , , 'j0', , , , , 'P1'],
        //    [, , , , 'M1', , 'Z1' , , ]
        //]
        /// <summary>졸 진격 테스트, 졸이 궁성에서 뒤로 대각선 이동하는 버그 수정할 것...</summary>
        //map = [
        //    [, , , , , 'J0' , , , ],
        //    [, , , , 'S0', , , , ],
        //    [, , , , , , , , ],
        //    [, , , 'Z1', , , , , ],
        //    [, , , , , , ,'Z2', ],
        //    [, , , , , , , , ],
        //    [, , , , 'Z0',  , , , ],
        //    [, , , , , , , , ],
        //    [, , , , 's0', 's1', , , ],
        //    [, , , , , 'j0', , , ]
        //]
        ////map = "상급 테스트";
        //map = [
        //    [, , , 'S0', , 'S1', , , ],
        //    [, , , , 'J0', , , 'C1', ],
        //    [, , 'M0', , 'P0', 'M1' , , 'P1', ],
        //    [, 'Z0', 'Z1', 'Z2', 'X0', , , 'Z3', 'Z4'],
        //    [, , 'C0', , , , , , ],
        //    [, , , , , , 'z3', 'z4', ],
        //    [, 'z0', 'z2', , 'm0' , ,, , ],
        //    [, , , , 'p1', , 'm1', , ],
        //    [, , , , 's1', , , , ],
        //    ['c0', , 'x0', 's0', 'j0', 'p0', 'x1', , 'c1']
        //];
        //map = [
        //    [, , , 'S0', , 'S1', , , ],
        //    [, , , , 'J0', , , 'C1', ],
        //    [, , 'M0', , 'P0', 'M1', , 'P1', ],
        //    [, 'Z0', 'Z1', 'Z2', 'X0', , , 'Z3', 'Z4'],
        //    [, , , , , , , , ],
        //    [, , , , , , 'z3', 'z4', ],
        //    [, 'z0', 'z2', , 'm0', , , , ],
        //    [, , 'C0', , 'p1', , 'm1', , ],
        //    [, , , 's0', 's1', , , , ],
        //    ['c0', , 'x0', , 'j0', 'p0', 'x1', , 'c1']
        //];
        //map = [
        //    [, , , , , 'J0' , , , ],
        //    [, , , , 'S0', , , , ],
        //    [, , , , , , , , ],
        //    [, , , , , , , , ],
        //    [, , , , , , ,, ],
        //    [, , , , 'Z1', 'M0', , 'Z2', ],
        //    [, , , , 'Z0',  , , , ],
        //    [, , , , , , , , ],
        //    [, , , , 's0', 's1', , , ],
        //    [, , , , , 'j0', , , ]
        //]
        //map = [
        //    ['C0', , 'X0', 'S0', , 'S1', 'X1', , 'C1'],
        //    [, , , , 'J0', , , ,],
        //    [, 'P0', , , 'P1' , , 'M1', ,],
        //    [, , , , 'M0', , , , 'Z4'],
        //    [, 'Z0', 'Z1', , ,'Z2', 'Z3', ,],
        //    [, , , , , , , ,],
        //    ['z0', , 'z1', 'z2', , , 'z3', , 'z4'],
        //    [, , 'm0', , 'p1', , 'm1', ,],
        //    [, , , , 's1', , , ,],
        //    ['c0', , 'x0', 's0', 'j0', 'p0', 'x1', , 'c1']
        //];
        //// 안상대 안상
        //// 류경장기 초급과 경기: 반복수 제거용
        //map = [
        //    [, , 'X0', 'S0', 'J0', , 'X1', ,],
        //    [, , , , 'S1', , , ,],
        //    [, , 'M0', , 'P0', , 'M1', 'P1',],
        //    [, 'Z0', 'Z1', , , 'Z2', 'Z3', 'Z4',],
        //    ['C0', , , , , , , ,],
        //    [, , , , , , , , 'C1'],
        //    ['z0', , 'z1', 'z2', 'x0', , 'z3', 'z4', 'x1'],
        //    [, 'p0', 'm0', , 'p1', , 'm1', ,],
        //    [, , , , 's1', , , ,],
        //    ['c0', , , 's0', 'j0', 'c1', , ,]
        //];
        //// 안상대 안상
        //// 류경장기 초급과 경기: 가운데 포로 오른쪽 차 달라고 함부터 시작할 것...
        //map = [
        //    [, , 'X0', 'S0', 'J0' , , 'X1', , ],
        //    [, , , , 'S1', , , ,],
        //    [, , 'M0', , 'P0', , 'M1', 'P1',],
        //    [, 'Z0', 'Z1', , , 'Z2', 'Z3', 'Z4' , ],
        //    ['C0', , , , , , , ,],
        //    [, , , , , , , , 'C1'],
        //    ['z0', , 'z1', 'z2', 'x0', , 'z3', 'z4', 'x1'],
        //    [, 'p0', 'm0', , 'p1', , 'm1', ,],
        //    [, , , , 's1', , , ,],
        //    ['c0', , , 's0', 'j0', 'c1' , , , ]
        //];
        return map;
    };
    MapManager.prototype.GetMapJanggunError = function () {
        /// <summary>[1] 에러 잡기 완성: 아래 포진에서 차가 사를 먹었을 때 한궁이 차를 먹지 못하고 끝나버림</summary>
        var map = [
            [, , , , , , , ,],
            ['c0', , , , 'S0', , , ,],
            [, , , , 'J0', , , ,],
            [, , 'x0', 'z1', , 'z2', , ,],
            [, , , , , , , ,],
            [, , , , , , , ,],
            [, , , , , , , ,],
            [, , , , 'p0', , , ,],
            [, , , , 'j0', , , ,],
            [, , , 's0', , 's1', , ,]
        ];
        /// <summary>[0] 에러 잡기 완성: 장군 테스트: 차와 상으로 장군 칠 때 초급은 통과, 중급/상급은 에러 => 왕이 공격받을 때 다시 검색하는 로직의 treeDepth를 2로 변경하니까 해결됨
        map = [
            ['c0', , , , , , , ,],
            [, , , , , , , ,],
            [, , , , , 'J0', , ,],
            [, , , , , 'Z0', 'Z1', 'Z2',],
            [, , , , , , , ,],
            [, , , , , 'x1', , ,],
            ['z0', , 'z1', , 'z2', , 'z3', , 'z4'],
            [, , , , 'p0', , , 'p1',],
            [, , , , 'j0', , , ,],
            [, 'm0', 'x0', 's0', , 's1', , ,]
        ];
    };
    return MapManager;
}());
//# sourceMappingURL=MapManager.js.map